Диплом/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ПланированиеОтпусков</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом/src/InformationRegisters/ВКМ_ПланированиеОтпусков/ВКМ_ПланированиеОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ПланированиеОтпусков</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Диплом/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда    
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ВКМ_ПланированиеОтпусков
	Движения.ВКМ_ПланированиеОтпусков.Записывать = Истина;
	Для Каждого ТекСтрокаОтпускаСотрудников Из ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ПланированиеОтпусков.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаОтпускаСотрудников.Сотрудник;
		Движение.ДатаНачала = ТекСтрокаОтпускаСотрудников.ДатаНачала;
		Движение.ДатаОкончания = ТекСтрокаОтпускаСотрудников.ДатаОкончания;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
